results/data/run4/native-static/erik-laptop/quarkus-io-thread-30000-WARM-UP.wrk2.out
Running 1m test @ http://erik-pc.local:8080/greeting/Bob
  4 threads and 100 connections
  Thread calibration: mean lat.: 1.310ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.306ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.293ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.295ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.27ms  582.13us   7.68ms   64.15%
    Req/Sec     7.91k   501.11    11.33k    74.79%
  1798189 requests in 1.00m, 125.19MB read
Requests/sec:  29969.81
Transfer/sec:      2.09MB