results/data/run4/native-static/erik-laptop/quarkus-io-thread-75000-MEASURE.wrk2.out
Running 1m test @ http://erik-pc.local:8080/greeting/Bob
  4 threads and 100 connections
  Thread calibration: mean lat.: 115.341ms, rate sampling interval: 609ms
  Thread calibration: mean lat.: 143.708ms, rate sampling interval: 1116ms
  Thread calibration: mean lat.: 111.475ms, rate sampling interval: 644ms
  Thread calibration: mean lat.: 214.929ms, rate sampling interval: 1362ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   682.29ms    1.21s    5.31s    87.28%
    Req/Sec    18.44k     1.40k   22.41k    66.81%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   80.64ms
 75.000%  763.39ms
 90.000%    2.26s 
 99.000%    4.83s 
 99.900%    5.10s 
 99.990%    5.24s 
 99.999%    5.31s 
100.000%    5.31s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.155     0.000000            1         1.00
      10.719     0.100000       367423         1.11
      25.599     0.200000       734769         1.25
      37.471     0.300000      1102742         1.43
      49.535     0.400000      1469721         1.67
      80.639     0.500000      1836853         2.00
     102.783     0.550000      2020380         2.22
     135.551     0.600000      2204142         2.50
     210.175     0.650000      2387737         2.86
     417.791     0.700000      2571375         3.33
     763.391     0.750000      2754926         4.00
     988.159     0.775000      2846900         4.44
    1212.415     0.800000      2938623         5.00
    1414.143     0.825000      3030676         5.71
    1639.423     0.850000      3122531         6.67
    1923.071     0.875000      3214094         8.00
    2079.743     0.887500      3260182         8.89
    2260.991     0.900000      3306021        10.00
    2533.375     0.912500      3351842        11.43
    3059.711     0.925000      3397757        13.33
    3854.335     0.937500      3443758        16.00
    3956.735     0.943750      3466767        17.78
    4052.991     0.950000      3489884        20.00
    4222.975     0.956250      3513186        22.86
    4390.911     0.962500      3535593        26.67
    4505.599     0.968750      3558556        32.00
    4554.751     0.971875      3570538        35.56
    4595.711     0.975000      3581980        40.00
    4636.671     0.978125      3593145        45.71
    4677.631     0.981250      3604479        53.33
    4722.687     0.984375      3616545        64.00
    4751.359     0.985938      3622108        71.11
    4780.031     0.987500      3627843        80.00
    4808.703     0.989062      3633785        91.43
    4837.375     0.990625      3639385       106.67
    4870.143     0.992188      3644644       128.00
    4890.623     0.992969      3647920       142.22
    4911.103     0.993750      3650663       160.00
    4931.583     0.994531      3653184       182.86
    4960.255     0.995313      3656338       213.33
    4984.831     0.996094      3659386       256.00
    4993.023     0.996484      3660361       284.44
    5009.407     0.996875      3662114       320.00
    5021.695     0.997266      3663412       365.71
    5038.079     0.997656      3665026       426.67
    5050.367     0.998047      3666330       512.00
    5058.559     0.998242      3667032       568.89
    5066.751     0.998437      3667640       640.00
    5074.943     0.998633      3668236       731.43
    5087.231     0.998828      3669003       853.33
    5099.519     0.999023      3669727      1024.00
    5107.711     0.999121      3670158      1137.78
    5115.903     0.999219      3670567      1280.00
    5119.999     0.999316      3670756      1462.86
    5128.191     0.999414      3671119      1706.67
    5140.479     0.999512      3671469      2048.00
    5148.671     0.999561      3671683      2275.56
    5156.863     0.999609      3671853      2560.00
    5165.055     0.999658      3672010      2925.71
    5177.343     0.999707      3672156      3413.33
    5193.727     0.999756      3672350      4096.00
    5201.919     0.999780      3672451      4551.11
    5210.111     0.999805      3672553      5120.00
    5214.207     0.999829      3672598      5851.43
    5222.399     0.999854      3672713      6826.67
    5230.591     0.999878      3672807      8192.00
    5234.687     0.999890      3672836      9102.22
    5242.879     0.999902      3672873     10240.00
    5259.263     0.999915      3672924     11702.86
    5271.551     0.999927      3672978     13653.33
    5275.647     0.999939      3673007     16384.00
    5279.743     0.999945      3673029     18204.44
    5283.839     0.999951      3673052     20480.00
    5287.935     0.999957      3673078     23405.71
    5292.031     0.999963      3673104     27306.67
    5296.127     0.999969      3673130     32768.00
    5296.127     0.999973      3673130     36408.89
    5300.223     0.999976      3673155     40960.00
    5300.223     0.999979      3673155     46811.43
    5304.319     0.999982      3673185     54613.33
    5304.319     0.999985      3673185     65536.00
    5304.319     0.999986      3673185     72817.78
    5304.319     0.999988      3673185     81920.00
    5308.415     0.999989      3673210     93622.86
    5308.415     0.999991      3673210    109226.67
    5308.415     0.999992      3673210    131072.00
    5308.415     0.999993      3673210    145635.56
    5308.415     0.999994      3673210    163840.00
    5308.415     0.999995      3673210    187245.71
    5308.415     0.999995      3673210    218453.33
    5312.511     0.999996      3673225    262144.00
    5312.511     1.000000      3673225          inf
#[Mean    =      682.292, StdDeviation   =     1211.436]
#[Max     =     5308.416, Total count    =      3673225]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  4412896 requests in 1.00m, 307.22MB read
Requests/sec:  73549.01
Transfer/sec:      5.12MB